[{"id":"kLAoswEACAAJ","title":"Harry Potter and the Cursed Child","author":"J. K. Rowling, Jack Thorne, John Tiffany","image":"http://books.google.com/books/content?id=kLAoswEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","description":"The official playscript of the original West End production of Harry Potter and the Cursed Child. It was always difficult being Harry Potter and it isn't much easier now that he is an overworked employee of the Ministry of Magic, a husband, and father of three school-age children. While Harry grapples with a past that refuses to stay where it belongs, his youngest son Albus must struggle with the weight of a family legacy he never wanted. As past and present fuse ominously, both father and son learn the uncomfortable truth: sometimes, darkness comes from unexpected places. The playscript for Harry Potter and the Cursed Child was originally released as a 'special rehearsal edition' alongside the opening of Jack Thorne's play in London's West End in summer 2016. Based on an original story by J.K. Rowling, John Tiffany and Jack Thorne, the play opened to rapturous reviews from theatregoers and critics alike, while the official playscript became an immediate global bestseller. This revised paperback edition updates the 'special rehearsal edition' with the conclusive and final dialogue from the play, which has subtly changed since its rehearsals, as well as a conversation piece between director John Tiffany and writer Jack Thorne, who share stories and insights about reading playscripts. This edition also includes useful background information including the Potter family tree and a timeline of events from the wizarding world prior to the beginning of Harry Potter and the Cursed Child.","category":["Fiction"]},{"id":"BcG2dVRXKukC","title":"The Name of the Wind","author":"Patrick Rothfuss","image":"http://books.google.com/books/content?id=BcG2dVRXKukC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"'This is a magnificent book' Anne McCaffrey 'I was reminded of Ursula K. Le Guin, George R. R. Martin, and J. R. R. Tolkein, but never felt that Rothfuss was imitating anyone' THE TIMES 'I have stolen princesses back from sleeping barrow kings. I burned down the town of Trebon. I have spent the night with Felurian and left with both my sanity and my life. I was expelled from the University at a younger age than most people are allowed in. I tread paths by moonlight that others fear to speak of during day. I have talked to Gods, loved women, and written songs that make the minstrels weep. My name is Kvothe. You may have heard of me' So begins the tale of Kvothe - currently known as Kote, the unassuming innkeepter - from his childhood in a troupe of traveling players, through his years spent as a near-feral orphan in a crime-riddled city, to his daringly brazen yet successful bid to enter a difficult and dangerous school of magic. In these pages you will come to know Kvothe the notorious magician, the accomplished thief, the masterful musician, the dragon-slayer, the legend-hunter, the lover, the thief and the infamous assassin.","category":["Fiction"]},{"id":"p1v6DwAAQBAJ","title":"Eloquent JavaScript, 3rd Edition","author":"Marijn Haverbeke","image":"http://books.google.com/books/content?id=p1v6DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"Completely revised and updated, this best-selling introduction to programming in JavaScript focuses on writing real applications. JavaScript lies at the heart of almost every modern web application, from social apps like Twitter to browser-based game frameworks like Phaser and Babylon. Though simple for beginners to pick up and play with, JavaScript is a flexible, complex language that you can use to build full-scale applications. This much anticipated and thoroughly revised third edition of Eloquent JavaScript dives deep into the JavaScript language to show you how to write beautiful, effective code. It has been updated to reflect the current state of Java¬Script and web browsers and includes brand-new material on features like class notation, arrow functions, iterators, async functions, template strings, and block scope. A host of new exercises have also been added to test your skills and keep you on track. As with previous editions, Haverbeke continues to teach through extensive examples and immerses you in code from the start, while exercises and full-chapter projects give you hands-on experience with writing your own programs. You start by learning the basic structure of the JavaScript language as well as control structures, functions, and data structures to help you write basic programs. Then you'll learn about error handling and bug fixing, modularity, and asynchronous programming before moving on to web browsers and how JavaScript is used to program them. As you build projects such as an artificial life simulation, a simple programming language, and a paint program, you'll learn how to: - Understand the essential elements of programming, including syntax, control, and data - Organize and clarify your code with object-oriented and functional programming techniques - Script the browser and make basic web applications - Use the DOM effectively to interact with browsers - Harness Node.js to build servers and utilities Isn't it time you became fluent in the language of the Web? * All source code is available online in an inter¬active sandbox, where you can edit the code, run it, and see its output instantly.","category":["Computers"]},{"id":"XiWGDwAAQBAJ","title":"Advanced JavaScript","author":"Zachary Shute","image":"http://books.google.com/books/content?id=XiWGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"Gain a deeper understanding of JavaScript and apply it to build small applications in backend, frontend, and mobile frameworks. Key Features Explore the new ES6 syntax, the event loop, and asynchronous programming Learn the test-driven development approach when building apps Master advanced JavaScript concepts to enhance your web developments skill Book Description If you are looking for a programming language to develop flexible and efficient applications, JavaScript is an obvious choice. Advanced JavaScript is a hands-on guide that takes you through JavaScript and its many features, one step at a time. You'll begin by learning how to use the new JavaScript syntax in ES6, and then work through the many other features that modern JavaScript has to offer. As you progress through the chapters, you’ll use asynchronous programming with callbacks and promises, handle browser events, and perform Document Object Model (DOM) manipulation. You'll also explore various methods of testing JavaScript projects. In the concluding chapters, you'll discover functional programming and learn to use it to build your apps. With this book as your guide, you'll also be able to develop APIs using Node.js and Express, create front-ends using React/Redux, and build mobile apps using React/Expo. By the end of Advanced JavaScript, you will have explored the features and benefits of JavaScript to build small applications. What you will learn Examine major features in ES6 and implement those features to build applications Create promise and callback handlers to work with asynchronous processes Develop asynchronous flows using Promise chaining and async/await syntax Manipulate the DOM with JavaScript Handle JavaScript browser events Explore Test Driven Development and build code tests with JavaScript code testing frameworks. List the benefits and drawbacks of functional programming compared to other styles Construct applications with the Node.js backend framework and the React frontend framework Who this book is for This book is designed to target anyone who wants to write JavaScript in a professional environment. We expect the audience to have used JavaScript in some capacity and be familiar with the basic syntax. This book would be good for a tech enthusiast wondering when to use generators or how to use Promises and Callbacks effectively, or a novice developer who wants to deepen their knowledge on JavaScript and understand TDD.","category":["Computers"]},{"id":"fpmQDwAAQBAJ","title":"Blood of Empire","author":"Brian McClellan","image":"http://books.google.com/books/content?id=fpmQDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"'A fast-paced story, set in a brilliantly realised world . . . One of the best fantasy novels of recent years' Bookbag on Sins of Empire Brian McClellan's Sins of Empire began an epic tale of magic and revolution. The story continued in Wrath of Empire, as rebels, spies and sorcerers clashed. Now this thrilling adventure reaches an explosive conclusion in Blood of Empire, the final novel in the Gods of Blood and Powder series. Praise for Brian McClellan: 'Gunpowder and magic. An explosive combination' Peter Brett 'Tense action, memorable characters, rising stakes . . . Brian McClellan is the real thing' Brent Weeks 'Brings a welcome breath of gunpowder-tinged air to epic fantasy' Anthony Ryan 'Innovative magic, quick-paced plot, interesting world. I had a blast' Brandon Sanderson Books by Brian McClellan: Gods of Blood and Powder Sins of Empire Wrath of Empire Blood of Empire The Powder Mage trilogy Promise of Blood (Winner of the Gemmell Morningstar Award) The Crimson Campaign The Autumn Republic","category":["Fiction"]},{"id":"psWWiOfKD8QC","title":"Promise of Blood","author":"Brian McClellan","image":"http://books.google.com/books/content?id=psWWiOfKD8QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"'Just plain awesome' Brandon Sanderson **Winner of the David Gemmell Morningstar Award** It's a bloody business, overthrowing a king. Now, amid the chaos, a whispered rumour is spreading. A rumour about a broken promise, omens of death and the gods returning to walk the earth. No one really believes these whispers. Perhaps they should. Winner of the David Gemmell Morningstar Award, Promise of Blood is the explosive first novel in the most action-packed and acclaimed new fantasy series in years. 'Gunpowder and magic. An explosive combination' Peter Brett 'Brings a welcome breath of gunpowder-tinged air to epic fantasy' Anthony Ryan 'Tense action, memorable characters, rising stakes . . . Brian McClellan is the real thing' Brent Weeks The Powder Mage trilogy: Promise of Blood The Crimson Campaign The Autumn Republic The Gods of Blood and Powder series: Sins of Empire Wrath of Empire","category":["Fiction"]},{"id":"3ZnHBAAAQBAJ","title":"Harry Potter and the Chamber of Secrets","author":"J. K. Rowling","image":"http://books.google.com/books/content?id=3ZnHBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"When the Chamber of Secrets is opened again at the Hogswart School for Witchcraft and Wizardry, second-year student Harry Potter finds himself in danger from a dark power that has once more been released on the school.","category":["Juvenile Fiction"]},{"id":"jD8iswEACAAJ","title":"Cracking the Coding Interview","author":"Gayle Laakmann McDowell","image":"http://books.google.com/books/content?id=jD8iswEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","description":"Now in the 6th edition, the book gives you the interview preparation you need to get the top software developer jobs. This is a deeply technical book and focuses on the software engineering skills to ace your interview. The book includes 189 programming interview questions and answers, as well as other advice.","category":["Business & Economics"]},{"id":"V5s14nks9I8C","title":"Jurassic Park","author":"Michael Crichton","image":"http://books.google.com/books/content?id=V5s14nks9I8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"#1 NEW YORK TIMES BESTSELLER • From the author of Timeline, Sphere, and Congo, this is the classic thriller of science run amok that took the world by storm. Nominated as one of America’s best-loved novels by PBS’s The Great American Read “[Michael] Crichton’s dinosaurs are genuinely frightening.”—Chicago Sun-Times An astonishing technique for recovering and cloning dinosaur DNA has been discovered. Now humankind’s most thrilling fantasies have come true. Creatures extinct for eons roam Jurassic Park with their awesome presence and profound mystery, and all the world can visit them—for a price. Until something goes wrong. . . . In Jurassic Park, Michael Crichton taps all his mesmerizing talent and scientific brilliance to create his most electrifying technothriller. Praise for Jurassic Park “Wonderful . . . powerful.”—The Washington Post Book World “Frighteningly real . . . compelling . . . It’ll keep you riveted.”—The Detroit News “Full of suspense.”—The New York Times Book Review","category":["Fiction"]},{"id":"t24kDAAAQBAJ","title":"The Blood Mirror","author":"Brent Weeks","image":"http://books.google.com/books/content?id=t24kDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"The Blood Mirror is the action-packed fourth novel in the Lightbringer series by international bestseller Brent Weeks. The Seven Satrapies have collapsed into four - and those are falling before the White King's armies. Gavin Guille, ex-emperor, ex-Prism, ex-galley slave, formerly the one man who might have averted war, is now lost, broken and trapped in a prison crafted by his own magical genius. But Gavin has no magic at all. Worse, in this prison, he may not be alone. Who will fight to prevent a tainted empire from becoming something even worse? 'Brent Weeks is so good it's beginning to tick me off' Peter V. Brett 'Weeks has a style of immediacy and detail that pulls the reader relentlessly into the story. He doesn't allow you to look away' Robin Hobb 'I was mesmerised from start to finish. Unforgettable characters, a plot that kept me guessing, non-stop action and the kind of in-depth storytelling that makes me admire a writer's work' Terry Brooks 'Weeks has truly cemented his place among the great epic fantasy writers of our time' British Fantasy Society Books by Brent Weeks Night Angel The Way of Shadows Shadow's Edge Beyond the Shadows Perfect Shadow (novella) Lightbringer The Black Prism The Blinding Knife The Broken Eye The Blood Mirror The Burning White","category":["Fiction"]},{"id":"35rHBAAAQBAJ","title":"Harry Potter and the Philosopher's Stone","author":"J. K. Rowling","image":"http://books.google.com/books/content?id=35rHBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"Celebrate 20 years of Harry Potter magic! Harry Potter has never even heard of Hogwarts when the letters start dropping on the doormat at number four, Privet Drive. Addressed in green ink on yellowish parchment with a purple seal, they are swiftly confiscated by his grisly aunt and uncle. Then, on Harry's eleventh birthday, a great beetle-eyed giant of a man called Rubeus Hagrid bursts in with some astonishing news: Harry Potter is a wizard, and he has a place at Hogwarts School of Witchcraft and Wizardry. An incredible adventure is about to begin!These new editions of the classic and internationally bestselling, multi-award-winning series feature instantly pick-up-able new jackets by Jonny Duddle, with huge child appeal, to bring Harry Potter to the next generation of readers. It's time to PASS THE MAGIC ON ...","category":["Juvenile Fiction"]},{"id":"L2EQuwEACAAJ","title":"Harry Potter and the Half-Blood Prince","author":"J. K. Rowling","image":"http://books.google.com/books/content?id=L2EQuwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","description":"As Harry enters his sixth year at Hogwarts, a storm is brewing in the battle between good and evil, a battle that promises to have incredible consequences for the magic world.","category":["England"]},{"id":"kTH6zAEACAAJ","title":"Harry Potter and the Philosopher's Stone","author":"J. K. Rowling","image":"http://books.google.com/books/content?id=kTH6zAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","description":"Rescued from the outrageous neglect of his aunt and uncle, a young boy with a great destiny proves his worth while attending Hogwarts School of Witchcraft and Wizardry.","category":["Children's stories"]},{"id":"L18VBQAAQBAJ","title":"The Psychology of Harry Potter","author":"Neil Mulholland","image":"http://books.google.com/books/content?id=L18VBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"Harry Potter has provided a portal to the wizarding world for millions of readers, but an examination of Harry, his friends and his enemies will take us on yet another journey: through the psyche of the Muggle (and wizard!) mind. The twists and turns of the series, as well as the psychological depth and complexity of J. K. Rowling’s characters, have kept fans enthralled with and puzzling over the many mysteries that permeate Hogwarts and beyond: • Do the Harry Potter books encourage disobedience? • Why is everyone so fascinated by Professor Lupin? • What exactly will Harry and his friends do when they finally pass those N.E.W.T.s? • Do even wizards live by the ticking of the clock? • Is Harry destined to end up alone? And why did it take Ron and Hermione so long to get together? Now, in The Psychology of Harry Potter, leading psychologists delve into the ultimate Chamber of Secrets, analyzing human mind and motivation by examining the themes and characters that make the Harry Potter books the bestselling fantasy series of all time. Grab a spot on the nearest couch, and settle in for some fresh revelations about our favorite young wizard!","category":["Literary Criticism"]},{"id":"dQkFLM8_5ZEC","title":"The Return of the King (The Lord of the Rings, Book 3)","author":"J. R. R. Tolkien","image":"http://books.google.com/books/content?id=dQkFLM8_5ZEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"Concluding the story of The Hobbit, this is the final part of Tolkien’s epic master piece.","category":["Fiction"]},{"id":"lqHNugAACAAJ","title":"The Fellowship of the Ring","author":"J. R. R. Tolkien","image":"http://books.google.com/books/content?id=lqHNugAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","description":"Sauron, the Dark Lord, has gathered to him all the Rings of Power - the means by which he intends to rule Middle-earth. All he lacks in his plans for dominion is the One Ring - the ring that rules them all - which has fallen into the hands of the hobbit, Bilbo Baggins.In a sleepy village in the Shire, young Frodo Baggins finds himself faced with an immense task, as his elderly cousin Bilbo entrusts the Ring to his care. Frodo must leave his home and make a perilous journey across Middle-earth to the Cracks of Doom, there to destroy the Ring and foil the Dark Lord in his evil purpose.To celebrate the release of the first of Peter Jackson's two-part film adaptation of The Hobbit, THE HOBBIT: AN UNEXPECTED JOURNEY, this first part of THE LORD OF THE RINGS is available for a limited time with an exclusive cover image from Peter Jackson's award-winning trilogy.","category":["Baggins, Frodo (Fictitious character)"]},{"id":"FRiViwMylSUC","title":"The Battle for Middle-earth","author":"Fleming Rutledge","image":"http://books.google.com/books/content?id=FRiViwMylSUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"Fleming Rutledge discovers the deeper religious meaning behind Tolkien's masterpiece.","category":["Literary Criticism"]},{"id":"ZMl5Al9CMUEC","title":"The Litigators","author":"John Grisham","image":"http://books.google.com/books/content?id=ZMl5Al9CMUEC&printsec=frontcover&img=1&zoom=1&source=gbs_api","description":"The best-selling author of The Confession and The Appeal presents a latest legal thriller in which high-stakes courtroom tensions lead up to an explosive, unorthodox conclusion. A best-selling novel. Reprint.","category":["Fiction"]},{"id":"S34bbe66PnUC","title":"The Associate","author":"John Grisham","image":"http://books.google.com/books/content?id=S34bbe66PnUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"_______________________________________ It's a deadly game of blackmail. And they're making him play. Kyle McAvoy is one of the outstanding legal students of his generation: he's good-looking, has a brilliant mind, and a glittering future is ahead of him. But he has a secret from his past, one that threatens to destroy his entire life. One night that secret catches up with him in the form of a deeply compromising video, and a message: Do what we say. Or the whole world sees this video. Their demand is unexpected: that Kyle take a job in New York as an associate at the largest law firm in the world. But Kyle won't be working for this company. He'll be a spy inside it, passing on the secrets of a trial that could be worth billions of dollars to the victor. And as Kyle is drawn ever deeper into the criminal web, he wonders if he'll ever get out alive... _______________________________________ ‘A master at the art of deft characterisation and the skilful delivery of hair-raising crescendos' – Irish Independent 'John Grisham is the master of legal fiction' – Jodi Picoult 'The best thriller writer alive' – Ken Follett ‘John Grisham has perfected the art of cooking up convincing, fast-paced thrillers’ – Telegraph ‘Grisham is a superb, instinctive storyteller’ – The Times ‘Grisham's storytelling genius reminds us that when it comes to legal drama, the master is in a league of his own.’ – Daily Record ‘Masterful – when Grisham gets in the courtroom he lets rip, drawing scenes so real they're not just alive, they're pulsating’ – Mirror ‘A giant of the thriller genre’ – TimeOut","category":["Fiction"]},{"id":"gDIScAAACAAJ","title":"The Chamber","author":"John Grisham","image":"http://books.google.com/books/content?id=gDIScAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","description":"Twenty-two years after the bombing of a Mississippi law office in which Marvin Kramer's two sons died, Klan member Sam Cayhill, the accused killer, has nearly exhausted his death row appeals, until young lawyer Adam Hall takes the case.","category":["Fiction"]},{"id":"CT2fHTMmcEMC","title":"The Partner","author":"John Grisham","image":"http://books.google.com/books/content?id=CT2fHTMmcEMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"They found him in a small town in Brazil, near the border with Paraguay. He had a new name, Danilo Silva, and his appearance had been changed by plastic surgery. The search had taken four years. They'd chased him around the world, always just missing him. It had cost their clients $3.5 million. But so far none of them had complained. The man they were about to kidnap had not always been called Danilo Silva. Before he had had another life, a life which ended in a car crash in February 1992. His gravestone lay in a cemetry in Biloxi, Mississippi. His name before his death was Patrick S. Lanigan. He had been a partner at an up-and-coming law firm. He had a pretty wife, a young daughter, and a bright future. Six weeks after his death, $90 million disappeared from the law firm. It was then that his partners knew he was still alive, and the long pursuit had begun...","category":["Biloxi (Miss.)"]},{"id":"5L5kW7d2dwIC","title":"The Broker","author":"John Grisham","image":"http://books.google.com/books/content?id=5L5kW7d2dwIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"_______________________________________ Someone is certain to kill Joel Backman. The question is: who? In his final hours in the Oval Office, the outgoing President grants a full pardon to Joel Backman, a notorious Washington power broker who has spent the last six years in a federal prison. Unknown to an outraged public, the pardon was the CIA's idea. They claim that Backman may have obtained secrets that would compromise American satellite surveillance. Smuggled out of the country in a military cargo plane, Backman is given a new identity and a new home in Italy. He thinks he's out. But the CIA will soon leak his whereabouts to the Israelis, the Russians, the Chinese and the Saudis, and then sit back and watch. The question is not whether Backman will survive – there's no chance of that. The question the CIA needs answered is: who will kill him? _______________________________________ ‘A master at the art of deft characterisation and the skilful delivery of hair-raising crescendos' – Irish Independent 'John Grisham is the master of legal fiction' – Jodi Picoult 'The best thriller writer alive' – Ken Follett ‘John Grisham has perfected the art of cooking up convincing, fast-paced thrillers’ – Telegraph ‘Grisham is a superb, instinctive storyteller’ – The Times ‘Grisham's storytelling genius reminds us that when it comes to legal drama, the master is in a league of his own.’ – Daily Record ‘Masterful – when Grisham gets in the courtroom he lets rip, drawing scenes so real they're not just alive, they're pulsating’ – Mirror ‘A giant of the thriller genre’ – TimeOut","category":["Fiction"]},{"title":"The Black Prism","author":"Brent Weeks","image":"http://books.google.com/books/content?id=bDcJqV-8dlIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"In a world where magic is tightly controlled, the most powerful man in history must choose between his kingdom and his son - in the first book of the New York Times bestselling Lightbringer series, one of the most popular fantasy epics of the decade. EVERY LIGHT CASTS A SHADOW. Guile is the Prism, the most powerful man in the world. He is high priest and emperor, a man whose power, wit, and charm are all that preserves a tenuous peace. Yet Prisms never last, and Guile knows exactly how long he has left to live. When Guile discovers he has a son, born in a far kingdom after the war that put him in power, he must decide how much he's willing to pay to protect a secret that could tear his world apart. With over four million copies sold, Brent Weeks is one of the fastest-selling fantasy authors of all time. 'Brent Weeks is so good it's beginning to tick me off' Peter V. Brett 'Weeks has a style of immediacy and detail that pulls the reader relentlessly into the story. He doesn't allow you to look away' Robin Hobb 'I was mesmerised from start to finish. Unforgettable characters, a plot that kept me guessing, non-stop action and the kind of in-depth storytelling that makes me admire a writers' work' Terry Brooks 'Weeks has truly cemented his place among the great epic fantasy writers of our time' British Fantasy Society Books by Brent Weeks Night Angel The Way of Shadows Shadow's Edge Beyond the Shadows Perfect Shadow (novella) Lightbringer The Black Prism The Blinding Knife The Broken Eye The Blood Mirror The Burning White","category":["Fiction"]},{"id":"Pln5r5gpp3IC","title":"The Confession","author":"John Grisham","image":"http://books.google.com/books/content?id=Pln5r5gpp3IC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"Thriller. When Travis Boyette is paroled because of inoperable brain tumor, for the first time in his life, he decides to do the right thing and tell police about a crime he committed and another man is about to be executed for","category":["Death row inmates"]}]