[{"id":"DD7djwEACAAJ","title":"The Art of Castle in the Sky","author":"Hayao Miyazaki","image":"http://books.google.com/books/content?id=DD7djwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","description":"The definitive examination of the art and animation of Studio Ghibli’s masterpiece of fantasy and flight, Castle in the Sky! The latest in the perennially popular line of Studio Ghibli art books, which includes interviews, concept sketches, and finished animation cels from classics such as Spirited Away and My Neighbor Totoro. Hayao Miyazaki’s Castle in the Sky was the first feature film produced by the legendary Studio Ghibli. Sheeta, a girl who has the power to defy gravity, is on the run from pirates when she meets the young inventor Pazu. Together they explore the secrets of Laputa, a flying city constructed by a long-lost race of people. All of Miyazaki’s major themes—the power of flight, the bravery of young women, and a world wrecked by change—are captured with beautiful animation and joyous storytelling.","category":["Performing Arts"]},{"id":"lZrHBAAAQBAJ","title":"Harry Potter and the Prisoner of Azkaban","author":"J. K. Rowling","image":"http://books.google.com/books/content?id=lZrHBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"When the Knight Bus crashes through the darkness and screeches to a halt in front of him, it's the start of another far from ordinary year at Hogwarts for Harry Potter. Sirius Black, escaped mass-murderer and follower of Lord Voldemort, is on the run - and they say he is coming after Harry. In his first ever Divination class, Professor Trelawney sees an omen of death in Harry's tea leaves . But perhaps most terrifying of all are the Dementors patrolling the school grounds, with their soul-sucking kiss. These new editions of the classic and internationally bestselling, multi-award-winning series feature instantly pick-up-able new jackets by Jonny Duddle, with huge child appeal, to bring Harry Potter to the next generation of readers. It's time to PASS THE MAGIC ON .","category":["Juvenile Fiction"]},{"id":"3ZnHBAAAQBAJ","title":"Harry Potter and the Chamber of Secrets","author":"J. K. Rowling","image":"http://books.google.com/books/content?id=3ZnHBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"When the Chamber of Secrets is opened again at the Hogswart School for Witchcraft and Wizardry, second-year student Harry Potter finds himself in danger from a dark power that has once more been released on the school.","category":["Juvenile Fiction"]},{"id":"Y0HbmAEACAAJ","title":"Harry Potter and the Order of the Phoenix","author":"J. K. Rowling","image":"http://books.google.com/books/content?id=Y0HbmAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","description":"As Harry faces his upcoming fifth year at Hogwarts Academy, there are increasing rumors of dark times coming and of Lord Voldemort's return to power, and a secret anti-Voldemort society, The Order of the Phoenix, begins meeting again.","category":["Juvenile Fiction"]},{"id":"BTMknk-qvacC","title":"The Glass Castle","author":"Jeannette Walls","image":"http://books.google.com/books/content?id=BTMknk-qvacC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"Journalist Walls grew up with parents whose ideals and stubborn nonconformity were their curse and their salvation. Rex and Rose Mary and their four children lived like nomads, moving among Southwest desert towns, camping in the mountains. Rex was a charismatic, brilliant man who, when sober, captured his children's imagination, teaching them how to embrace life fearlessly. Rose Mary painted and wrote and couldn't stand the responsibility of providing for her family. When the money ran out, the Walls retreated to the dismal West Virginia mining town Rex had tried to escape. As the dysfunction escalated, the children had to fend for themselves, supporting one another as they found the resources and will to leave home. Yet Walls describes her parents with deep affection in this tale of unconditional love in a family that, despite its profound flaws, gave her the fiery determination to carve out a successful life. -- From publisher description.","category":["Biography & Autobiography"]},{"id":"UaeTvgEACAAJ","title":"The Way of Kings","author":"Brandon Sanderson","image":"http://books.google.com/books/content?id=UaeTvgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","description":"The brand new epic fantasy series from international bestseller Brandon Sanderson. According to mythology mankind used to live in The Tranquiline Halls. Heaven. But then the Voidbringers assaulted and captured heaven, casting out God and men. Men took root on Roshar, the world of storms. And the Voidbringers followed ... They came against man ten thousand times. To help them cope, the Almighty gave men powerful suits of armor and mystical weapons, known as Shardblades. Led by ten angelic Heralds and ten orders of knights known as Radiants, mankind finally won. Or so the legends say. Today, the only remnants of those supposed battles are the Shardblades, the possession of which makes a man nearly invincible on the battlefield. The entire world is at war with itself - and has been for centuries since the Radiants turned against mankind. Kings strive to win more Shardblades, each secretly wishing to be the one who will finally unite all of mankind under a single throne. On a world scoured down to the rock by terrifying hurricanes that blow through every few days is a young spearman, forced into the army of a Shardbearer, led to war against an enemy he doesn't understand and doesn't really want to fight. What happened deep in mankind's past? Why did the Radiants turn against mankind, and what happened to the magic they used to wield?","category":["Fantasy"]},{"id":"OHclhBVv-X4C","title":"The Way of Kings","author":"Brandon Sanderson","image":"http://books.google.com/books/content?id=OHclhBVv-X4C&printsec=frontcover&img=1&zoom=1&source=gbs_api","description":"From #1 New York Times bestselling author Brandon Sanderson, The Way of Kings, Book One of the Stormlight Archive begins an incredible new saga of epic proportion. Roshar is a world of stone and storms. Uncanny tempests of incredible power sweep across the rocky terrain so frequently that they have shaped ecology and civilization alike. Animals hide in shells, trees pull in branches, and grass retracts into the soilless ground. Cities are built only where the topography offers shelter. It has been centuries since the fall of the ten consecrated orders known as the Knights Radiant, but their Shardblades and Shardplate remain: mystical swords and suits of armor that transform ordinary men into near-invincible warriors. Men trade kingdoms for Shardblades. Wars were fought for them, and won by them. One such war rages on a ruined landscape called the Shattered Plains. There, Kaladin, who traded his medical apprenticeship for a spear to protect his little brother, has been reduced to slavery. In a war that makes no sense, where ten armies fight separately against a single foe, he struggles to save his men and to fathom the leaders who consider them expendable. Brightlord Dalinar Kholin commands one of those other armies. Like his brother, the late king, he is fascinated by an ancient text called The Way of Kings. Troubled by over-powering visions of ancient times and the Knights Radiant, he has begun to doubt his own sanity. Across the ocean, an untried young woman named Shallan seeks to train under an eminent scholar and notorious heretic, Dalinar's niece, Jasnah. Though she genuinely loves learning, Shallan's motives are less than pure. As she plans a daring theft, her research for Jasnah hints at secrets of the Knights Radiant and the true cause of the war. The result of over ten years of planning, writing, and world-building, The Way of Kings is but the opening movement of the Stormlight Archive, a bold masterpiece in the making. Speak again the ancient oaths: Life before death. Strength before weakness. Journey before Destination. and return to men the Shards they once bore. The Knights Radiant must stand again. Other Tor books by Brandon Sanderson The Cosmere The Stormlight Archive The Way of Kings Words of Radiance Edgedancer (Novella) Oathbringer The Mistborn trilogy Mistborn: The Final Empire The Well of Ascension The Hero of Ages Mistborn: The Wax and Wayne series Alloy of Law Shadows of Self Bands of Mourning Collection Arcanum Unbounded Other Cosmere novels Elantris Warbreaker The Alcatraz vs. the Evil Librarians series Alcatraz vs. the Evil Librarians The Scrivener's Bones The Knights of Crystallia The Shattered Lens The Dark Talent The Rithmatist series The Rithmatist Other books by Brandon Sanderson The Reckoners Steelheart Firefight Calamity At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.","category":["Fiction"]},{"id":"DDYPzgEACAAJ","title":"Rhythm of War","author":"Brandon Sanderson","image":"http://books.google.com/books/content?id=DDYPzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","description":"An instant #1 New York Times Bestseller and a USA Today and Indie Bestseller! The Stormlight Archive saga continues in Rhythm of War, the eagerly awaited sequel to Brandon Sanderson's #1 New York Times bestselling Oathbringer, from an epic fantasy writer at the top of his game. After forming a coalition of human resistance against the enemy invasion, Dalinar Kholin and his Knights Radiant have spent a year fighting a protracted, brutal war. Neither side has gained an advantage, and the threat of a betrayal by Dalinar’s crafty ally Taravangian looms over every strategic move. Now, as new technological discoveries by Navani Kholin’s scholars begin to change the face of the war, the enemy prepares a bold and dangerous operation. The arms race that follows will challenge the very core of the Radiant ideals, and potentially reveal the secrets of the ancient tower that was once the heart of their strength. At the same time that Kaladin Stormblessed must come to grips with his changing role within the Knights Radiant, his Windrunners face their own problem: As more and more deadly enemy Fused awaken to wage war, no more honorspren are willing to bond with humans to increase the number of Radiants. Adolin and Shallan must lead the coalition’s envoy to the honorspren stronghold of Lasting Integrity and either convince the spren to join the cause against the evil god Odium, or personally face the storm of failure. Other Tor books by Brandon Sanderson The Cosmere The Stormlight Archive The Way of Kings Words of Radiance Edgedancer (Novella) Oathbringer Rhythm of War The Mistborn trilogy Mistborn: The Final Empire The Well of Ascension The Hero of Ages Mistborn: The Wax and Wayne series Alloy of Law Shadows of Self Bands of Mourning Collection Arcanum Unbounded Other Cosmere novels Elantris Warbreaker The Alcatraz vs. the Evil Librarians series Alcatraz vs. the Evil Librarians The Scrivener's Bones The Knights of Crystallia The Shattered Lens The Dark Talent The Rithmatist series The Rithmatist Other books by Brandon Sanderson The Reckoners Steelheart Firefight Calamity","category":["Fiction"]},{"id":"2EounwEACAAJ","title":"The Name of the Wind","author":"Patrick Rothfuss","image":"http://books.google.com/books/content?id=2EounwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","description":"A hero named Kvothe, now living under an assumed name as the humble proprietor of an inn, recounts his transformation from a magically gifted young man into the most notorious wizard, musician, thief, and assassin in his world. Reprint.","category":["Fiction"]},{"id":"ycTADgAAQBAJ","title":"Learning React","author":"Alex Banks, Eve Porcello","image":"http://books.google.com/books/content?id=ycTADgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"If you want to learn how to build efficient user interfaces with React, this is your book. Authors Alex Banks and Eve Porcello show you how to create UIs with this small JavaScript library that can deftly display data changes on large-scale, data-driven websites without page reloads. Along the way, you’ll learn how to work with functional programming and the latest ECMAScript features. Developed by Facebook, and used by companies including Netflix, Walmart, and The New York Times for large parts of their web interfaces, React is quickly growing in use. By learning how to build React components with this hands-on guide, you’ll fully understand how useful React can be in your organization. Learn key functional programming concepts with JavaScript Peek under the hood to understand how React runs in the browser Create application presentation layers by mounting and composing React components Use component trees to manage data and reduce the time you spend debugging applications Explore React’s component lifecycle and use it to load data and improve UI performance Use a routing solution for browser history, bookmarks, and other features of single-page applications Learn how to structure React applications with servers in mind","category":["Computers"]},{"id":"35rHBAAAQBAJ","title":"Harry Potter and the Philosopher's Stone","author":"J. K. Rowling","image":"http://books.google.com/books/content?id=35rHBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"Celebrate 20 years of Harry Potter magic! Harry Potter has never even heard of Hogwarts when the letters start dropping on the doormat at number four, Privet Drive. Addressed in green ink on yellowish parchment with a purple seal, they are swiftly confiscated by his grisly aunt and uncle. Then, on Harry's eleventh birthday, a great beetle-eyed giant of a man called Rubeus Hagrid bursts in with some astonishing news: Harry Potter is a wizard, and he has a place at Hogwarts School of Witchcraft and Wizardry. An incredible adventure is about to begin!These new editions of the classic and internationally bestselling, multi-award-winning series feature instantly pick-up-able new jackets by Jonny Duddle, with huge child appeal, to bring Harry Potter to the next generation of readers. It's time to PASS THE MAGIC ON ...","category":["Juvenile Fiction"]},{"id":"3Cjz7DKv74MC","title":"Warbreaker","author":"Brandon Sanderson","image":"http://books.google.com/books/content?id=3Cjz7DKv74MC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"Warbreaker is the story of two sisters - who happen to be princesses, the God King one of them has to marry, a lesser god, and an immortal trying to undo the mistakes he made hundreds of years ago. Theirs is a world in which those who die in glory return as gods to live confined to a pantheon in Hallandren's capital city. A world transformed by BioChromatic magic, a power based on an essence known as breath. Using magic is arduous: breath can only be collected one unit at a time from individual people. But the rewards are great: by using breath and drawing upon the color in everyday objects, all manner of miracles and mischief can be performed. Brandon Sanderson proves again that he is a master of what Tolkien called 'secondary creation,' the invention of whole worlds, complete with magics and myths all their own.","category":["Fiction"]},{"id":"N6DeDQAAQBAJ","title":"Harry Potter and the Deathly Hallows","author":"J. K. Rowling","image":"http://books.google.com/books/content?id=N6DeDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"Harry Potter is preparing to leave the Dursleys and Privet Drive for the last time. But the future that awaits him is full of danger, not only for him, but for anyone close to him - and Harry has already lost so much. Only by destroying Voldemort's remaining Horcruxes can Harry free himself and overcome the Dark Lord's forces of evil. In this dramatic conclusion to the Harry Potter series, Harry must leave his most loyal friends behind, and in a final perilous journey find the strength and the will to face his terrifying destiny: a deadly confrontation that is his alone to fight. These adult editions with glorious jacket art by Andrew Davidson are now available in hardback for the first time.","category":["Boarding schools"]},{"id":"p1v6DwAAQBAJ","title":"Eloquent JavaScript, 3rd Edition","author":"Marijn Haverbeke","image":"http://books.google.com/books/content?id=p1v6DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"Completely revised and updated, this best-selling introduction to programming in JavaScript focuses on writing real applications. JavaScript lies at the heart of almost every modern web application, from social apps like Twitter to browser-based game frameworks like Phaser and Babylon. Though simple for beginners to pick up and play with, JavaScript is a flexible, complex language that you can use to build full-scale applications. This much anticipated and thoroughly revised third edition of Eloquent JavaScript dives deep into the JavaScript language to show you how to write beautiful, effective code. It has been updated to reflect the current state of Java¬Script and web browsers and includes brand-new material on features like class notation, arrow functions, iterators, async functions, template strings, and block scope. A host of new exercises have also been added to test your skills and keep you on track. As with previous editions, Haverbeke continues to teach through extensive examples and immerses you in code from the start, while exercises and full-chapter projects give you hands-on experience with writing your own programs. You start by learning the basic structure of the JavaScript language as well as control structures, functions, and data structures to help you write basic programs. Then you'll learn about error handling and bug fixing, modularity, and asynchronous programming before moving on to web browsers and how JavaScript is used to program them. As you build projects such as an artificial life simulation, a simple programming language, and a paint program, you'll learn how to: - Understand the essential elements of programming, including syntax, control, and data - Organize and clarify your code with object-oriented and functional programming techniques - Script the browser and make basic web applications - Use the DOM effectively to interact with browsers - Harness Node.js to build servers and utilities Isn't it time you became fluent in the language of the Web? * All source code is available online in an inter¬active sandbox, where you can edit the code, run it, and see its output instantly.","category":["Computers"]},{"id":"XiWGDwAAQBAJ","title":"Advanced JavaScript","author":"Zachary Shute","image":"http://books.google.com/books/content?id=XiWGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"Gain a deeper understanding of JavaScript and apply it to build small applications in backend, frontend, and mobile frameworks. Key Features Explore the new ES6 syntax, the event loop, and asynchronous programming Learn the test-driven development approach when building apps Master advanced JavaScript concepts to enhance your web developments skill Book Description If you are looking for a programming language to develop flexible and efficient applications, JavaScript is an obvious choice. Advanced JavaScript is a hands-on guide that takes you through JavaScript and its many features, one step at a time. You'll begin by learning how to use the new JavaScript syntax in ES6, and then work through the many other features that modern JavaScript has to offer. As you progress through the chapters, you’ll use asynchronous programming with callbacks and promises, handle browser events, and perform Document Object Model (DOM) manipulation. You'll also explore various methods of testing JavaScript projects. In the concluding chapters, you'll discover functional programming and learn to use it to build your apps. With this book as your guide, you'll also be able to develop APIs using Node.js and Express, create front-ends using React/Redux, and build mobile apps using React/Expo. By the end of Advanced JavaScript, you will have explored the features and benefits of JavaScript to build small applications. What you will learn Examine major features in ES6 and implement those features to build applications Create promise and callback handlers to work with asynchronous processes Develop asynchronous flows using Promise chaining and async/await syntax Manipulate the DOM with JavaScript Handle JavaScript browser events Explore Test Driven Development and build code tests with JavaScript code testing frameworks. List the benefits and drawbacks of functional programming compared to other styles Construct applications with the Node.js backend framework and the React frontend framework Who this book is for This book is designed to target anyone who wants to write JavaScript in a professional environment. We expect the audience to have used JavaScript in some capacity and be familiar with the basic syntax. This book would be good for a tech enthusiast wondering when to use generators or how to use Promises and Callbacks effectively, or a novice developer who wants to deepen their knowledge on JavaScript and understand TDD.","category":["Computers"]},{"id":"bzekBgAAQBAJ","title":"Beginning JavaScript","author":"Jeremy McPeak","image":"http://books.google.com/books/content?id=bzekBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"The bestselling JavaScript guide, updated with current features and best practices Beginning JavaScript 5th Edition shows you how to work effectively with JavaScript frameworks, functions, and modern browsers, and teaches more effective coding practices using HTML5. This new edition has been extensively updated to reflect the way JavaScript is most commonly used today, introducing you to the latest tools and techniques available to JavaScript developers. Coverage includes modern coding practices using HTML5 markup, the JSON data format, DOM APIs, the jQuery framework, and more. Exercises with solutions provide plenty of opportunity to practice, and the companion website offers downloadable code for all examples given in the book. Learn JavaScript using the most up to date coding style Understand JSON, functions, events, and feature detection Utilize the new HTML5 elements and the related API Explore new features including geolocation, local storage, and more JavaScript has shaped the Web from a passive medium into one that is rich, dynamic, and interactive. No matter the technology on the server side, it's JavaScript that makes it come alive in the browser. To learn JavaScript the way it's used today, Beginning JavaScript, 5th Edition is your concise guide.","category":["Computers"]},{"id":"jD8iswEACAAJ","title":"Cracking the Coding Interview","author":"Gayle Laakmann McDowell","image":"http://books.google.com/books/content?id=jD8iswEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","description":"Now in the 6th edition, the book gives you the interview preparation you need to get the top software developer jobs. This is a deeply technical book and focuses on the software engineering skills to ace your interview. The book includes 189 programming interview questions and answers, as well as other advice.","category":["Business & Economics"]},{"id":"S3QJGM58BacC","title":"The Crimson Campaign","author":"Brian McClellan","image":"http://books.google.com/books/content?id=S3QJGM58BacC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"'Just plain awesome . . . Innovative magic, quick-paced plot, interesting world. I had a blast' Brandon Sanderson on Promise of Blood Field Marshal Tamas's invasion of Kez has ended in disaster. Stranded behind enemy lines and hounded by the enemy's finest, Tamas must lead his remaining men on a reckless retreat through northern Kez to safety. In Adro, Inspector Adamat wants only to rescue his wife. To do so, he must hunt down and confront the enigmatic Lord Vetus - but the truth he learns is far darker than he could have imagined. The god Kremsimir wants the head of Tamas's son, Taniel - the man who shot him in the eye. With Tamas and his powder mages presumed dead, only Taniel can lead the charge against the vengeful god and his invading army. Praise for the series: 'Gunpowder and magic. An explosive combination' Peter Brett 'Brings a welcome breath of gunpowder-tinged air to epic fantasy' Anthony Ryan 'Tense action, memorable characters, rising stakes . . . Brian McClellan is the real thing' Brent Weeks The Powder Mage trilogy: Promise of Blood The Crimson Campaign The Autumn Republic The Gods of Blood and Powder series: Sins of Empire Wrath of Empire","category":["Fiction"]},{"id":"fpmQDwAAQBAJ","title":"Blood of Empire","author":"Brian McClellan","image":"http://books.google.com/books/content?id=fpmQDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"'A fast-paced story, set in a brilliantly realised world . . . One of the best fantasy novels of recent years' Bookbag on Sins of Empire Brian McClellan's Sins of Empire began an epic tale of magic and revolution. The story continued in Wrath of Empire, as rebels, spies and sorcerers clashed. Now this thrilling adventure reaches an explosive conclusion in Blood of Empire, the final novel in the Gods of Blood and Powder series. Praise for Brian McClellan: 'Gunpowder and magic. An explosive combination' Peter Brett 'Tense action, memorable characters, rising stakes . . . Brian McClellan is the real thing' Brent Weeks 'Brings a welcome breath of gunpowder-tinged air to epic fantasy' Anthony Ryan 'Innovative magic, quick-paced plot, interesting world. I had a blast' Brandon Sanderson Books by Brian McClellan: Gods of Blood and Powder Sins of Empire Wrath of Empire Blood of Empire The Powder Mage trilogy Promise of Blood (Winner of the Gemmell Morningstar Award) The Crimson Campaign The Autumn Republic","category":["Fiction"]},{"id":"GR84DwAAQBAJ","title":"Wrath of Empire","author":"Brian McClellan","image":"http://books.google.com/books/content?id=GR84DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"'A fast paced story, set in a brilliantly realised world . . . One of the best fantasy novels of recent years' Bookbag on Sins of Empire The country is in turmoil. With the capital city occupied, half a million refugees are on the march, looking for safety on the frontier, accompanied by Lady Flint's soldiers. But escaping war is never easy, and soon the battle may find them, whether they are prepared or not. Back in the capital, Michel Bravis smuggles even more refugees out of the city. But internal forces are working against him. With enemies on all sides, Michael may be forced to find help with the very occupiers he's trying to undermine. Meanwhile, Ben Styke is building his own army. He and his mad lancers are gathering every able body they can find and searching for an ancient artifact that may have the power to turn the tides of war in their favor. But what they find may not be what they're looking for. Magic and gunpowder collide in Wrath of Empire, the explosive second novel in the Gods of Blood and Powder series. Praise for Brian McClellan: 'Gunpowder and magic. An explosive combination' Peter Brett 'Brings a welcome breath of gunpowder-tinged air to epic fantasy' Anthony Ryan 'Tense action, memorable characters, rising stakes . . . Brian McClellan is the real thing' Brent Weeks 'Innovative magic, quick-paced plot, interesting world. I had a blast' Brandon Sanderson Books by Brian McClellan: Gods of Blood and Powder Sins of Empire Wrath of Empire The Powder Mage trilogy Promise of Blood (Winner of the Gemmell Morningstar Award) The Crimson Campaign The Autumn Republic","category":["Fiction"]},{"id":"ptHZAAAAMAAJ","title":"The Lord of the Rings","author":"j.r.r. tolkien, John Ronald Reuel Tolkien","image":"http://books.google.com/books/content?id=ptHZAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","description":"Presents the epic depicting the Great War of the Ring, a struggle between good and evil in Middle Earth.","category":["Fiction"]},{"id":"Dw-NAgAAQBAJ","title":"The Lord of the Rings and Philosophy","author":"Gregory Bassham, Eric Bronson","image":"http://books.google.com/books/content?id=Dw-NAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"The Lord of the Rings is intended to be applicable to the real world of relationships, religion, pleasure, pain, and politics. Tolkien himself said that his grand tale of wizards, orcs, hobbits, and elves was aimed at truth and good morals in the actual world. Analysis of the popular appeal of The Lord of the Rings (on websites and elsewhere) shows that Tolkien fans are hungry for discussion of the urgent moral and cosmological issues arising out of this fantastic epic story. Can political power be wielded for good, or must it always corrupt? Does technology destroy the truly human? Is it morally wrong to give up hope? Can we find meaning in chance events? In The Lord of the Rings and Philosophy, seventeen young philosophy professors, all of them ardent Tolkien fans and most of them contributors to the four earlier volumes in the Popular Culture and Philosophy series, address some of these important issues and show how clues to their solutions may be found in the imaginary world of Middle-earth. The book is divided into five sections, concerned with Power and the Ring, the Quest for Happiness, Good and Evil in Middle-earth, Time and Mortality, and the Relevance","category":["Philosophy"]},{"id":"jNjKrXRP0G8C","title":"Picturing Tolkien","author":"Janice M. Bogstad, Philip E. Kaveny","image":"http://books.google.com/books/content?id=jNjKrXRP0G8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"This group of new critical essays offers multidisciplinary analysis of director Peter Jackson’s spectacularly successful adaptations of J.R.R. Tolkien’s Lord of the Rings trilogy: The Fellowship of the Ring (2001), The Two Towers (2002) and The Return of the King (2003). Part One of the collection, “Techniques of Structure and Story,” compares and contrasts the organizational principles of the books and films. Part Two, “Techniques of Character and Culture,” focuses on the methods used to transform the characters and settings of Tolkien’s narrative into the personalities and places visualized on screen. Each of the sixteen essays includes extensive notes and a separate bibliography. Instructors considering this book for use in a course may request an examination copy here.","category":["Performing Arts"]},{"id":"yhIRBwAAQBAJ","title":"Six of Crows","author":"Leigh Bardugo","image":"http://books.google.com/books/content?id=yhIRBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"The Grishaverse will be coming to Netflix soon with Shadow and Bone, an original series! Enter the Grishaverse with the #1 New York Times–bestselling Six of Crows, Book One of the Six of Crows Duology. Ketterdam: a bustling hub of international trade where anything can be had for the right price—and no one knows that better than criminal prodigy Kaz Brekker. Kaz is offered a chance at a deadly heist that could make him rich beyond his wildest dreams. But he can't pull it off alone. . . . A convict with a thirst for revenge. A sharpshooter who can't walk away from a wager. A runaway with a privileged past. A spy known as the Wraith. A Heartrender using her magic to survive the slums. A thief with a gift for unlikely escapes. Six dangerous outcasts. One impossible heist. Kaz's crew is the only thing that might stand between the world and destruction—if they don't kill each other first. Six of Crows by Leigh Bardugo returns to the breathtaking world of the Grishaverse in this unforgettable tale about the opportunity—and the adventure—of a lifetime. Praise for Six of Crows: “Six of Crows is a twisty and elegantly crafted masterpiece that thrilled me from the beginning to end.” –New York Times-bestselling author Holly Black “Six of Crows [is] one of those all-too-rare, unputdownable books that keeps your eyes glued to the page and your brain scrambling to figure out what’s going to happen next.” –Michael Dante DiMartino, co-creator of Avatar: The Last Airbender and The Legend of Korra “There's conflict between morality and amorality and an appetite for sometimes grimace-inducing violence that recalls the Game of Thrones series. But for every bloody exchange there are pages of crackling dialogue and sumptuous description. Bardugo dives deep into this world, with full color and sound. If you're not careful, it'll steal all your time.” —The New York Times Book Review Read all the books in the Grishaverse! The Shadow and Bone Trilogy (previously published as The Grisha Trilogy) Shadow and Bone Siege and Storm Ruin and Rising The Six of Crows Duology Six of Crows Crooked Kingdom The King of Scars Duology King of Scars The Language of Thorns: Midnight Tales and Dangerous Magic The Severed Moon: A Year-Long Journal of Magic Praise for the Grishaverse “A master of fantasy.” —The Huffington Post “Utterly, extremely bewitching.” —The Guardian “The best magic universe since Harry Potter.” —Bustle “This is what fantasy is for.” —The New York Times Book Review “[A] world that feels real enough to have its own passport stamp.” —NPR “The darker it gets for the good guys, the better.” —Entertainment Weekly “Sultry, sweeping and picturesque. . . . Impossible to put down.” —USA Today “There’s a level of emotional and historical sophistication within Bardugo’s original epic fantasy that sets it apart.” —Vanity Fair “Unlike anything I’ve ever read.” —Veronica Roth, bestselling author of Divergent “Bardugo crafts a first-rate adventure, a poignant romance, and an intriguing mystery!” —Rick Riordan, bestselling author of the Percy Jackson series","category":["Young Adult Fiction"]},{"id":"kLAoswEACAAJ","title":"Harry Potter and the Cursed Child","author":"J. K. Rowling","image":"http://books.google.com/books/content?id=kLAoswEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","description":"The official playscript of the original West End production of Harry Potter and the Cursed Child. It was always difficult being Harry Potter and it isn't much easier now that he is an overworked employee of the Ministry of Magic, a husband, and father of three school-age children. While Harry grapples with a past that refuses to stay where it belongs, his youngest son Albus must struggle with the weight of a family legacy he never wanted. As past and present fuse ominously, both father and son learn the uncomfortable truth: sometimes, darkness comes from unexpected places. The playscript for Harry Potter and the Cursed Child was originally released as a 'special rehearsal edition' alongside the opening of Jack Thorne's play in London's West End in summer 2016. Based on an original story by J.K. Rowling, John Tiffany and Jack Thorne, the play opened to rapturous reviews from theatregoers and critics alike, while the official playscript became an immediate global bestseller. This revised paperback edition updates the 'special rehearsal edition' with the conclusive and final dialogue from the play, which has subtly changed since its rehearsals, as well as a conversation piece between director John Tiffany and writer Jack Thorne, who share stories and insights about reading playscripts. This edition also includes useful background information including the Potter family tree and a timeline of events from the wizarding world prior to the beginning of Harry Potter and the Cursed Child.","category":["Fiction"]},{"id":"V5s14nks9I8C","title":"Jurassic Park","author":"Michael Crichton","image":"http://books.google.com/books/content?id=V5s14nks9I8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"#1 NEW YORK TIMES BESTSELLER • From the author of Timeline, Sphere, and Congo, this is the classic thriller of science run amok that took the world by storm. Nominated as one of America’s best-loved novels by PBS’s The Great American Read “[Michael] Crichton’s dinosaurs are genuinely frightening.”—Chicago Sun-Times An astonishing technique for recovering and cloning dinosaur DNA has been discovered. Now humankind’s most thrilling fantasies have come true. Creatures extinct for eons roam Jurassic Park with their awesome presence and profound mystery, and all the world can visit them—for a price. Until something goes wrong. . . . In Jurassic Park, Michael Crichton taps all his mesmerizing talent and scientific brilliance to create his most electrifying technothriller. Praise for Jurassic Park “Wonderful . . . powerful.”—The Washington Post Book World “Frighteningly real . . . compelling . . . It’ll keep you riveted.”—The Detroit News “Full of suspense.”—The New York Times Book Review","category":["Fiction"]},{"id":"LNqqI4rdfgUC","title":"Rising Sun","author":"Michael Crichton","image":"http://books.google.com/books/content?id=LNqqI4rdfgUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"On the forty-fifth floor of the Nakamoto Tower in downtown L. A. a grand opening celebration is in full swing at the new American headquarters of the immense Japanese conglomerate. On the forty-sixth floor, in an empty conference room, the dead body of a","category":["Business intelligence"]},{"id":"6Rzdzs2hkZAC","title":"Michael Crichton's Jurassic World","author":"Michael Crichton","image":"http://books.google.com/books/content?id=6Rzdzs2hkZAC&printsec=frontcover&img=1&zoom=1&source=gbs_api","description":"The author's sagas of science run amok and a prehistoric, dinosaur-dominated world are presented in an omnibus edition containing \"Jurassic Park\" and \"The Lost World\"","category":["Fiction"]},{"id":"8WXnDQAAQBAJ","title":"The Cursed Lands (epic fantasy/sword and sorcery)","author":"Timothy L. Cerepaka","image":"http://books.google.com/books/content?id=8WXnDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"Long ago, the Dragon Gods founded the land of Yores. They drove out the monsters which lived within it and gave the land to their followers, who thanked the Dragon Gods and pledged to worship them for eternity. As time went on, however, the Yoresians grew proud and ceased worshipping the Dragon Gods, trusting instead in their magic. Thus, the Dragon Gods abandoned the Yoresians, which has turned out to be a mistake, for now the land of Yores is under attack from a powerful evil and the Yoresians cannot stand against it. Twin siblings Sarzen and Helnia, a warrior and a mage, set out to find the Dragon Gods, who they believe are their people's only hope of survival. But the quest ahead of them is fraught with dangers they can't even imagine, including a revelation about themselves that will shake their view of themselves and their leaders forever. KEYWORDS: epic fantasy adventure series, epic fantasy dragons, epic fantasy magic, epic fantasy sword and sorcery, sword and sorcery adult fantasy, sword and sorcery series, sword and sorcery series magic","category":["Fiction"]},{"id":"rKOCCwAAQBAJ","title":"Fantasy Art Bible","author":"Jackie Strachan","image":"http://books.google.com/books/content?id=rKOCCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"An inspirational and practical guide to art techniques, The Fantasy Art Bible is all you need to create fantasy and science fiction masterpieces.","category":["Art"]}]