[{"id":"kLAoswEACAAJ","title":"Harry Potter and the Cursed Child","author":"J. K. Rowling, Jack Thorne, John Tiffany","image":"http://books.google.com/books/content?id=kLAoswEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","previewlink":"http://books.google.co.uk/books?id=kLAoswEACAAJ&dq=harry+potter&hl=&as_pt=BOOKS&cd=1&source=gbs_api","description":"The official playscript of the original West End production of Harry Potter and the Cursed Child. It was always difficult being Harry Potter and it isn't much easier now that he is an overworked employee of the Ministry of Magic, a husband, and father of three school-age children. While Harry grapples with a past that refuses to stay where it belongs, his youngest son Albus must struggle with the weight of a family legacy he never wanted. As past and present fuse ominously, both father and son learn the uncomfortable truth: sometimes, darkness comes from unexpected places. The playscript for Harry Potter and the Cursed Child was originally released as a 'special rehearsal edition' alongside the opening of Jack Thorne's play in London's West End in summer 2016. Based on an original story by J.K. Rowling, John Tiffany and Jack Thorne, the play opened to rapturous reviews from theatregoers and critics alike, while the official playscript became an immediate global bestseller. This revised paperback edition updates the 'special rehearsal edition' with the conclusive and final dialogue from the play, which has subtly changed since its rehearsals, as well as a conversation piece between director John Tiffany and writer Jack Thorne, who share stories and insights about reading playscripts. This edition also includes useful background information including the Potter family tree and a timeline of events from the wizarding world prior to the beginning of Harry Potter and the Cursed Child.","category":["Fiction"]},{"id":"35rHBAAAQBAJ","title":"Harry Potter and the Philosopher's Stone","author":"J. K. Rowling","image":"http://books.google.com/books/content?id=35rHBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","previewlink":"http://books.google.co.uk/books?id=35rHBAAAQBAJ&printsec=frontcover&dq=harry+potter&hl=&as_pt=BOOKS&cd=2&source=gbs_api","description":"Celebrate 20 years of Harry Potter magic! Harry Potter has never even heard of Hogwarts when the letters start dropping on the doormat at number four, Privet Drive. Addressed in green ink on yellowish parchment with a purple seal, they are swiftly confiscated by his grisly aunt and uncle. Then, on Harry's eleventh birthday, a great beetle-eyed giant of a man called Rubeus Hagrid bursts in with some astonishing news: Harry Potter is a wizard, and he has a place at Hogwarts School of Witchcraft and Wizardry. An incredible adventure is about to begin!These new editions of the classic and internationally bestselling, multi-award-winning series feature instantly pick-up-able new jackets by Jonny Duddle, with huge child appeal, to bring Harry Potter to the next generation of readers. It's time to PASS THE MAGIC ON ...","category":["Juvenile Fiction"]},{"id":"lZrHBAAAQBAJ","title":"Harry Potter and the Prisoner of Azkaban","author":"J. K. Rowling","image":"http://books.google.com/books/content?id=lZrHBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","previewlink":"http://books.google.co.uk/books?id=lZrHBAAAQBAJ&printsec=frontcover&dq=harry+potter&hl=&as_pt=BOOKS&cd=15&source=gbs_api","description":"When the Knight Bus crashes through the darkness and screeches to a halt in front of him, it's the start of another far from ordinary year at Hogwarts for Harry Potter. Sirius Black, escaped mass-murderer and follower of Lord Voldemort, is on the run - and they say he is coming after Harry. In his first ever Divination class, Professor Trelawney sees an omen of death in Harry's tea leaves . But perhaps most terrifying of all are the Dementors patrolling the school grounds, with their soul-sucking kiss. These new editions of the classic and internationally bestselling, multi-award-winning series feature instantly pick-up-able new jackets by Jonny Duddle, with huge child appeal, to bring Harry Potter to the next generation of readers. It's time to PASS THE MAGIC ON .","category":["Juvenile Fiction"]},{"id":"BcG2dVRXKukC","title":"The Name of the Wind","author":"Patrick Rothfuss","image":"http://books.google.com/books/content?id=BcG2dVRXKukC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","previewlink":"http://books.google.co.uk/books?id=BcG2dVRXKukC&printsec=frontcover&dq=in+the+name+of+wind&hl=&as_pt=BOOKS&cd=1&source=gbs_api","description":"'This is a magnificent book' Anne McCaffrey 'I was reminded of Ursula K. Le Guin, George R. R. Martin, and J. R. R. Tolkein, but never felt that Rothfuss was imitating anyone' THE TIMES 'I have stolen princesses back from sleeping barrow kings. I burned down the town of Trebon. I have spent the night with Felurian and left with both my sanity and my life. I was expelled from the University at a younger age than most people are allowed in. I tread paths by moonlight that others fear to speak of during day. I have talked to Gods, loved women, and written songs that make the minstrels weep. My name is Kvothe. You may have heard of me' So begins the tale of Kvothe - currently known as Kote, the unassuming innkeepter - from his childhood in a troupe of traveling players, through his years spent as a near-feral orphan in a crime-riddled city, to his daringly brazen yet successful bid to enter a difficult and dangerous school of magic. In these pages you will come to know Kvothe the notorious magician, the accomplished thief, the masterful musician, the dragon-slayer, the legend-hunter, the lover, the thief and the infamous assassin.","category":["Fiction"]},{"id":"3ZnHBAAAQBAJ","title":"Harry Potter and the Chamber of Secrets","author":"J. K. Rowling","image":"http://books.google.com/books/content?id=3ZnHBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","previewlink":"http://books.google.co.uk/books?id=3ZnHBAAAQBAJ&printsec=frontcover&dq=harry+potter&hl=&as_pt=BOOKS&cd=19&source=gbs_api","description":"When the Chamber of Secrets is opened again at the Hogswart School for Witchcraft and Wizardry, second-year student Harry Potter finds himself in danger from a dark power that has once more been released on the school.","category":["Juvenile Fiction"]},{"id":"p1v6DwAAQBAJ","title":"Eloquent JavaScript, 3rd Edition","author":"Marijn Haverbeke","image":"http://books.google.com/books/content?id=p1v6DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","previewlink":"http://books.google.co.uk/books?id=p1v6DwAAQBAJ&printsec=frontcover&dq=javascript&hl=&as_pt=BOOKS&cd=3&source=gbs_api","description":"Completely revised and updated, this best-selling introduction to programming in JavaScript focuses on writing real applications. JavaScript lies at the heart of almost every modern web application, from social apps like Twitter to browser-based game frameworks like Phaser and Babylon. Though simple for beginners to pick up and play with, JavaScript is a flexible, complex language that you can use to build full-scale applications. This much anticipated and thoroughly revised third edition of Eloquent JavaScript dives deep into the JavaScript language to show you how to write beautiful, effective code. It has been updated to reflect the current state of Java¬Script and web browsers and includes brand-new material on features like class notation, arrow functions, iterators, async functions, template strings, and block scope. A host of new exercises have also been added to test your skills and keep you on track. As with previous editions, Haverbeke continues to teach through extensive examples and immerses you in code from the start, while exercises and full-chapter projects give you hands-on experience with writing your own programs. You start by learning the basic structure of the JavaScript language as well as control structures, functions, and data structures to help you write basic programs. Then you'll learn about error handling and bug fixing, modularity, and asynchronous programming before moving on to web browsers and how JavaScript is used to program them. As you build projects such as an artificial life simulation, a simple programming language, and a paint program, you'll learn how to: - Understand the essential elements of programming, including syntax, control, and data - Organize and clarify your code with object-oriented and functional programming techniques - Script the browser and make basic web applications - Use the DOM effectively to interact with browsers - Harness Node.js to build servers and utilities Isn't it time you became fluent in the language of the Web? * All source code is available online in an inter¬active sandbox, where you can edit the code, run it, and see its output instantly.","category":["Computers"]},{"id":"XiWGDwAAQBAJ","title":"Advanced JavaScript","author":"Zachary Shute","image":"http://books.google.com/books/content?id=XiWGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","previewlink":"http://books.google.co.uk/books?id=XiWGDwAAQBAJ&printsec=frontcover&dq=javascript&hl=&as_pt=BOOKS&cd=13&source=gbs_api","description":"Gain a deeper understanding of JavaScript and apply it to build small applications in backend, frontend, and mobile frameworks. Key Features Explore the new ES6 syntax, the event loop, and asynchronous programming Learn the test-driven development approach when building apps Master advanced JavaScript concepts to enhance your web developments skill Book Description If you are looking for a programming language to develop flexible and efficient applications, JavaScript is an obvious choice. Advanced JavaScript is a hands-on guide that takes you through JavaScript and its many features, one step at a time. You'll begin by learning how to use the new JavaScript syntax in ES6, and then work through the many other features that modern JavaScript has to offer. As you progress through the chapters, you’ll use asynchronous programming with callbacks and promises, handle browser events, and perform Document Object Model (DOM) manipulation. You'll also explore various methods of testing JavaScript projects. In the concluding chapters, you'll discover functional programming and learn to use it to build your apps. With this book as your guide, you'll also be able to develop APIs using Node.js and Express, create front-ends using React/Redux, and build mobile apps using React/Expo. By the end of Advanced JavaScript, you will have explored the features and benefits of JavaScript to build small applications. What you will learn Examine major features in ES6 and implement those features to build applications Create promise and callback handlers to work with asynchronous processes Develop asynchronous flows using Promise chaining and async/await syntax Manipulate the DOM with JavaScript Handle JavaScript browser events Explore Test Driven Development and build code tests with JavaScript code testing frameworks. List the benefits and drawbacks of functional programming compared to other styles Construct applications with the Node.js backend framework and the React frontend framework Who this book is for This book is designed to target anyone who wants to write JavaScript in a professional environment. We expect the audience to have used JavaScript in some capacity and be familiar with the basic syntax. This book would be good for a tech enthusiast wondering when to use generators or how to use Promises and Callbacks effectively, or a novice developer who wants to deepen their knowledge on JavaScript and understand TDD.","category":["Computers"]},{"id":"bzekBgAAQBAJ","title":"Beginning JavaScript","author":"Jeremy McPeak","image":"http://books.google.com/books/content?id=bzekBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","previewlink":"http://books.google.co.uk/books?id=bzekBgAAQBAJ&printsec=frontcover&dq=javascript&hl=&as_pt=BOOKS&cd=6&source=gbs_api","description":"The bestselling JavaScript guide, updated with current features and best practices Beginning JavaScript 5th Edition shows you how to work effectively with JavaScript frameworks, functions, and modern browsers, and teaches more effective coding practices using HTML5. This new edition has been extensively updated to reflect the way JavaScript is most commonly used today, introducing you to the latest tools and techniques available to JavaScript developers. Coverage includes modern coding practices using HTML5 markup, the JSON data format, DOM APIs, the jQuery framework, and more. Exercises with solutions provide plenty of opportunity to practice, and the companion website offers downloadable code for all examples given in the book. Learn JavaScript using the most up to date coding style Understand JSON, functions, events, and feature detection Utilize the new HTML5 elements and the related API Explore new features including geolocation, local storage, and more JavaScript has shaped the Web from a passive medium into one that is rich, dynamic, and interactive. No matter the technology on the server side, it's JavaScript that makes it come alive in the browser. To learn JavaScript the way it's used today, Beginning JavaScript, 5th Edition is your concise guide.","category":["Computers"]},{"id":"jD8iswEACAAJ","title":"Cracking the Coding Interview","author":"Gayle Laakmann McDowell","image":"http://books.google.com/books/content?id=jD8iswEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","previewlink":"http://books.google.co.uk/books?id=jD8iswEACAAJ&dq=cracking+the+coding+interview&hl=&as_pt=BOOKS&cd=1&source=gbs_api","description":"Now in the 6th edition, the book gives you the interview preparation you need to get the top software developer jobs. This is a deeply technical book and focuses on the software engineering skills to ace your interview. The book includes 189 programming interview questions and answers, as well as other advice.","category":["Business & Economics"]},{"id":"psWWiOfKD8QC","title":"Promise of Blood","author":"Brian McClellan","image":"http://books.google.com/books/content?id=psWWiOfKD8QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","previewlink":"http://books.google.co.uk/books?id=psWWiOfKD8QC&printsec=frontcover&dq=promise+of+blood&hl=&as_pt=BOOKS&cd=1&source=gbs_api","description":"'Just plain awesome' Brandon Sanderson **Winner of the David Gemmell Morningstar Award** It's a bloody business, overthrowing a king. Now, amid the chaos, a whispered rumour is spreading. A rumour about a broken promise, omens of death and the gods returning to walk the earth. No one really believes these whispers. Perhaps they should. Winner of the David Gemmell Morningstar Award, Promise of Blood is the explosive first novel in the most action-packed and acclaimed new fantasy series in years. 'Gunpowder and magic. An explosive combination' Peter Brett 'Brings a welcome breath of gunpowder-tinged air to epic fantasy' Anthony Ryan 'Tense action, memorable characters, rising stakes . . . Brian McClellan is the real thing' Brent Weeks The Powder Mage trilogy: Promise of Blood The Crimson Campaign The Autumn Republic The Gods of Blood and Powder series: Sins of Empire Wrath of Empire","category":["Fiction"]},{"id":"S3QJGM58BacC","title":"The Crimson Campaign","author":"Brian McClellan","image":"http://books.google.com/books/content?id=S3QJGM58BacC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","previewlink":"http://books.google.co.uk/books?id=S3QJGM58BacC&printsec=frontcover&dq=promise+of+blood&hl=&as_pt=BOOKS&cd=5&source=gbs_api","description":"'Just plain awesome . . . Innovative magic, quick-paced plot, interesting world. I had a blast' Brandon Sanderson on Promise of Blood Field Marshal Tamas's invasion of Kez has ended in disaster. Stranded behind enemy lines and hounded by the enemy's finest, Tamas must lead his remaining men on a reckless retreat through northern Kez to safety. In Adro, Inspector Adamat wants only to rescue his wife. To do so, he must hunt down and confront the enigmatic Lord Vetus - but the truth he learns is far darker than he could have imagined. The god Kremsimir wants the head of Tamas's son, Taniel - the man who shot him in the eye. With Tamas and his powder mages presumed dead, only Taniel can lead the charge against the vengeful god and his invading army. Praise for the series: 'Gunpowder and magic. An explosive combination' Peter Brett 'Brings a welcome breath of gunpowder-tinged air to epic fantasy' Anthony Ryan 'Tense action, memorable characters, rising stakes . . . Brian McClellan is the real thing' Brent Weeks The Powder Mage trilogy: Promise of Blood The Crimson Campaign The Autumn Republic The Gods of Blood and Powder series: Sins of Empire Wrath of Empire","category":["Fiction"]},{"id":"fpmQDwAAQBAJ","title":"Blood of Empire","author":"Brian McClellan","image":"http://books.google.com/books/content?id=fpmQDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","previewlink":"http://books.google.co.uk/books?id=fpmQDwAAQBAJ&pg=PP1&dq=promise+of+blood&hl=&as_pt=BOOKS&cd=6&source=gbs_api","description":"'A fast-paced story, set in a brilliantly realised world . . . One of the best fantasy novels of recent years' Bookbag on Sins of Empire Brian McClellan's Sins of Empire began an epic tale of magic and revolution. The story continued in Wrath of Empire, as rebels, spies and sorcerers clashed. Now this thrilling adventure reaches an explosive conclusion in Blood of Empire, the final novel in the Gods of Blood and Powder series. Praise for Brian McClellan: 'Gunpowder and magic. An explosive combination' Peter Brett 'Tense action, memorable characters, rising stakes . . . Brian McClellan is the real thing' Brent Weeks 'Brings a welcome breath of gunpowder-tinged air to epic fantasy' Anthony Ryan 'Innovative magic, quick-paced plot, interesting world. I had a blast' Brandon Sanderson Books by Brian McClellan: Gods of Blood and Powder Sins of Empire Wrath of Empire Blood of Empire The Powder Mage trilogy Promise of Blood (Winner of the Gemmell Morningstar Award) The Crimson Campaign The Autumn Republic","category":["Fiction"]},{"id":"GR84DwAAQBAJ","title":"Wrath of Empire","author":"Brian McClellan","image":"http://books.google.com/books/content?id=GR84DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","previewlink":"http://books.google.co.uk/books?id=GR84DwAAQBAJ&pg=PP1&dq=promise+of+blood&hl=&as_pt=BOOKS&cd=8&source=gbs_api","description":"'A fast paced story, set in a brilliantly realised world . . . One of the best fantasy novels of recent years' Bookbag on Sins of Empire The country is in turmoil. With the capital city occupied, half a million refugees are on the march, looking for safety on the frontier, accompanied by Lady Flint's soldiers. But escaping war is never easy, and soon the battle may find them, whether they are prepared or not. Back in the capital, Michel Bravis smuggles even more refugees out of the city. But internal forces are working against him. With enemies on all sides, Michael may be forced to find help with the very occupiers he's trying to undermine. Meanwhile, Ben Styke is building his own army. He and his mad lancers are gathering every able body they can find and searching for an ancient artifact that may have the power to turn the tides of war in their favor. But what they find may not be what they're looking for. Magic and gunpowder collide in Wrath of Empire, the explosive second novel in the Gods of Blood and Powder series. Praise for Brian McClellan: 'Gunpowder and magic. An explosive combination' Peter Brett 'Brings a welcome breath of gunpowder-tinged air to epic fantasy' Anthony Ryan 'Tense action, memorable characters, rising stakes . . . Brian McClellan is the real thing' Brent Weeks 'Innovative magic, quick-paced plot, interesting world. I had a blast' Brandon Sanderson Books by Brian McClellan: Gods of Blood and Powder Sins of Empire Wrath of Empire The Powder Mage trilogy Promise of Blood (Winner of the Gemmell Morningstar Award) The Crimson Campaign The Autumn Republic","category":["Fiction"]},{"id":"V5s14nks9I8C","title":"Jurassic Park","author":"Michael Crichton","image":"http://books.google.com/books/content?id=V5s14nks9I8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","previewlink":"http://books.google.co.uk/books?id=V5s14nks9I8C&printsec=frontcover&dq=jurassic+park&hl=&as_pt=BOOKS&cd=2&source=gbs_api","description":"#1 NEW YORK TIMES BESTSELLER • From the author of Timeline, Sphere, and Congo, this is the classic thriller of science run amok that took the world by storm. Nominated as one of America’s best-loved novels by PBS’s The Great American Read “[Michael] Crichton’s dinosaurs are genuinely frightening.”—Chicago Sun-Times An astonishing technique for recovering and cloning dinosaur DNA has been discovered. Now humankind’s most thrilling fantasies have come true. Creatures extinct for eons roam Jurassic Park with their awesome presence and profound mystery, and all the world can visit them—for a price. Until something goes wrong. . . . In Jurassic Park, Michael Crichton taps all his mesmerizing talent and scientific brilliance to create his most electrifying technothriller. Praise for Jurassic Park “Wonderful . . . powerful.”—The Washington Post Book World “Frighteningly real . . . compelling . . . It’ll keep you riveted.”—The Detroit News “Full of suspense.”—The New York Times Book Review","category":["Fiction"]},{"id":"6Rzdzs2hkZAC","title":"Michael Crichton's Jurassic World","author":"Michael Crichton","image":"http://books.google.com/books/content?id=6Rzdzs2hkZAC&printsec=frontcover&img=1&zoom=1&source=gbs_api","previewlink":"http://books.google.co.uk/books?id=6Rzdzs2hkZAC&q=michael+critcton&dq=michael+critcton&hl=&as_pt=BOOKS&cd=12&source=gbs_api","description":"The author's sagas of science run amok and a prehistoric, dinosaur-dominated world are presented in an omnibus edition containing \"Jurassic Park\" and \"The Lost World\"","category":["Fiction"]},{"id":"LNqqI4rdfgUC","title":"Rising Sun","author":"Michael Crichton","image":"http://books.google.com/books/content?id=LNqqI4rdfgUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","previewlink":"http://books.google.co.uk/books?id=LNqqI4rdfgUC&printsec=frontcover&dq=michael+critcton&hl=&as_pt=BOOKS&cd=17&source=gbs_api","description":"On the forty-fifth floor of the Nakamoto Tower in downtown L. A. a grand opening celebration is in full swing at the new American headquarters of the immense Japanese conglomerate. On the forty-sixth floor, in an empty conference room, the dead body of a","category":["Business intelligence"]},{"id":"t24kDAAAQBAJ","title":"The Blood Mirror","author":"Brent Weeks","image":"http://books.google.com/books/content?id=t24kDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","previewlink":"http://books.google.co.uk/books?id=t24kDAAAQBAJ&printsec=frontcover&dq=brent+weeks&hl=&as_pt=BOOKS&cd=7&source=gbs_api","description":"The Blood Mirror is the action-packed fourth novel in the Lightbringer series by international bestseller Brent Weeks. The Seven Satrapies have collapsed into four - and those are falling before the White King's armies. Gavin Guille, ex-emperor, ex-Prism, ex-galley slave, formerly the one man who might have averted war, is now lost, broken and trapped in a prison crafted by his own magical genius. But Gavin has no magic at all. Worse, in this prison, he may not be alone. Who will fight to prevent a tainted empire from becoming something even worse? 'Brent Weeks is so good it's beginning to tick me off' Peter V. Brett 'Weeks has a style of immediacy and detail that pulls the reader relentlessly into the story. He doesn't allow you to look away' Robin Hobb 'I was mesmerised from start to finish. Unforgettable characters, a plot that kept me guessing, non-stop action and the kind of in-depth storytelling that makes me admire a writer's work' Terry Brooks 'Weeks has truly cemented his place among the great epic fantasy writers of our time' British Fantasy Society Books by Brent Weeks Night Angel The Way of Shadows Shadow's Edge Beyond the Shadows Perfect Shadow (novella) Lightbringer The Black Prism The Blinding Knife The Broken Eye The Blood Mirror The Burning White","category":["Fiction"]},{"id":"iSYaBAAAQBAJ","title":"The Way of Shadows: The Graphic Novel","author":"Brent Weeks","image":"http://books.google.com/books/content?id=iSYaBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","previewlink":"http://books.google.co.uk/books?id=iSYaBAAAQBAJ&printsec=frontcover&dq=brent+weeks&hl=&as_pt=BOOKS&cd=5&source=gbs_api","description":"For Durzo Blint, assassination is an art-and he is the city's most accomplished artist. For Azoth, survival is precarious. Something you never take for granted. As a guild rat, he's grown up in the slums, and learned to judge people quickly - and to take risks. Risks like apprenticing himself to Durzo Blint. But to be accepted, Azoth must turn his back on his old life and embrace a new identity and name. As Kylar Stern, he must learn to navigate the assassins' world of dangerous politics and strange magics - and cultivate a flair for death.","category":["Comics & Graphic Novels"]},{"id":"rKOCCwAAQBAJ","title":"Fantasy Art Bible","author":"Jackie Strachan","image":"http://books.google.com/books/content?id=rKOCCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","previewlink":"http://books.google.co.uk/books?id=rKOCCwAAQBAJ&pg=PA6&dq=fantasy&hl=&as_pt=BOOKS&cd=3&source=gbs_api","description":"An inspirational and practical guide to art techniques, The Fantasy Art Bible is all you need to create fantasy and science fiction masterpieces.","category":["Art"]},{"id":"8WXnDQAAQBAJ","title":"The Cursed Lands (epic fantasy/sword and sorcery)","author":"Timothy L. Cerepaka","image":"http://books.google.com/books/content?id=8WXnDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","previewlink":"http://books.google.co.uk/books?id=8WXnDQAAQBAJ&pg=PA166&dq=fantasy&hl=&as_pt=BOOKS&cd=16&source=gbs_api","description":"Long ago, the Dragon Gods founded the land of Yores. They drove out the monsters which lived within it and gave the land to their followers, who thanked the Dragon Gods and pledged to worship them for eternity. As time went on, however, the Yoresians grew proud and ceased worshipping the Dragon Gods, trusting instead in their magic. Thus, the Dragon Gods abandoned the Yoresians, which has turned out to be a mistake, for now the land of Yores is under attack from a powerful evil and the Yoresians cannot stand against it. Twin siblings Sarzen and Helnia, a warrior and a mage, set out to find the Dragon Gods, who they believe are their people's only hope of survival. But the quest ahead of them is fraught with dangers they can't even imagine, including a revelation about themselves that will shake their view of themselves and their leaders forever. KEYWORDS: epic fantasy adventure series, epic fantasy dragons, epic fantasy magic, epic fantasy sword and sorcery, sword and sorcery adult fantasy, sword and sorcery series, sword and sorcery series magic","category":["Fiction"]}]