[{"id":"rKOCCwAAQBAJ","title":"Fantasy Art Bible","author":"Jackie Strachan","image":"http://books.google.com/books/content?id=rKOCCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"An inspirational and practical guide to art techniques, The Fantasy Art Bible is all you need to create fantasy and science fiction masterpieces.","category":["Art"]},{"id":"6Rzdzs2hkZAC","title":"Michael Crichton's Jurassic World","author":"Michael Crichton","image":"http://books.google.com/books/content?id=6Rzdzs2hkZAC&printsec=frontcover&img=1&zoom=1&source=gbs_api","description":"The author's sagas of science run amok and a prehistoric, dinosaur-dominated world are presented in an omnibus edition containing \"Jurassic Park\" and \"The Lost World\"","category":["Fiction"]},{"id":"BcG2dVRXKukC","title":"The Name of the Wind","author":"Patrick Rothfuss","image":"http://books.google.com/books/content?id=BcG2dVRXKukC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"'This is a magnificent book' Anne McCaffrey 'I was reminded of Ursula K. Le Guin, George R. R. Martin, and J. R. R. Tolkein, but never felt that Rothfuss was imitating anyone' THE TIMES 'I have stolen princesses back from sleeping barrow kings. I burned down the town of Trebon. I have spent the night with Felurian and left with both my sanity and my life. I was expelled from the University at a younger age than most people are allowed in. I tread paths by moonlight that others fear to speak of during day. I have talked to Gods, loved women, and written songs that make the minstrels weep. My name is Kvothe. You may have heard of me' So begins the tale of Kvothe - currently known as Kote, the unassuming innkeepter - from his childhood in a troupe of traveling players, through his years spent as a near-feral orphan in a crime-riddled city, to his daringly brazen yet successful bid to enter a difficult and dangerous school of magic. In these pages you will come to know Kvothe the notorious magician, the accomplished thief, the masterful musician, the dragon-slayer, the legend-hunter, the lover, the thief and the infamous assassin.","category":["Fiction"]},{"id":"14","title":"test5","author":"author test5","image":"image test5","description":"description test5","category":[]}]